{
  "aboutMe": {
    "description": [
      "Hi, My name is Khang. I am a Web Developer and freelancer. I",
      "discovered my passion for Web Development after a period of time that",
      "I dived into a bunch of things. I jumped into a various languages and",
      "move to another after a certain time. It's just a process of trial and",
      "error which I willing to try new and unfamiliar things to discover the",
      "thing that I would like to live with my career. On that journey, I",
      "throw myself into a numerous fields like Windows Forms Application,",
      "Computer Vision, and even Machine Learning. I give myself a try with",
      "many things, but I do not have any insight into specific field. I used",
      "to think that Information Technology is not right for me until I",
      "discovered Web Development. From that moment, I've put months of my",
      "life in on Web Development to get to know and live with it. I hope",
      "that I could notice Web Development sooner as possible in my life, but",
      "it did not make me regret. Because on that journey, I could learn a",
      "lot of things, specially the way that adapting and dealing with new",
      "things. I strongly believe that it will help me out to stay in control",
      "in the ever-changing world of technology."
    ],
    "quote": {
      "content": [
        "I am the type of person if you ask me a question and I do not know",
        "the answer, I am going to tell you that I do not know. But I bet you",
        "what. I know how to find the answer, and I will find the answer."
      ],
      "source": ["Chris Gardner in", "The Pursuit of Happyness"]
    },
    "info": {
      "birthday": "01 August 1998",
      "github": "github.com/tranminhkhang8198",
      "phone": "+84 939-127-356",
      "degree": "Bachelor",
      "mail": "minhkhang811998@gmail.com",
      "facebook": "fb.com/minhkhang080198"
    }
  },
  "abilities": {
    "selfStudy": [
      "Belong studying at school, I spend most of my time to take advantage of Web Development by taking various courses on Udemy about HTML, CSS, Javascript, NodeJS,...",
      "I really put my foot in my projects at school with all my effort instead of just passing the exams."
    ],
    "teamwork": {
      "description": "I have a chance to take part in a lot of projects with my classmates and also my university lecturer. Each project, I gained a lot of worth experience that I would not know if I just spent time studying at school.",
      "content": [
        "Teamwork skill: doing projects with numerous of different people helps me improving my communication skills and integrate with other people more easily.",
        "Aware of the importance of clean code for maintaining purpose.",
        "Knowing the way that start a project from scratch with step by step like gathering customer requirements, planing, designing database, coding and testing.",
        "Being aware of database importance, therefore spending more time on analysis and design database.",
        "Knowing how to use Git and Github for project management and integrate with other members.",
        "Knowing how to create API Documentation to help Font-End and Back-End communicate more easily.",
        "Knowing more about security like JWT, Authentication, Authorization,... and hacking method like Phishing, SQL Injection, Cross Site Scripting (XSS),...",
        "Improving my self-learning skill and research skill."
      ]
    },
    "skills": [
      {
        "language": "HTML",
        "icon": "fas fa-code",
        "percent": "75%"
      },
      {
        "language": "CSS",
        "icon": "fab fa-css3",
        "percent": "70%"
      },
      {
        "language": "Bootstrap",
        "icon": "fab fa-bootstrap",
        "percent": "70%"
      },
      {
        "language": "Javascript",
        "icon": "fab fa-js-square",
        "percent": "80%"
      },
      {
        "language": "VueJS",
        "icon": "fab fa-vuejs",
        "percent": "85%"
      },
      {
        "language": "NodeJS",
        "icon": "fab fa-node",
        "percent": "85%"
      },
      {
        "language": "MongoDB & Mongoose",
        "icon": "fas fa-database",
        "percent": "85%"
      },
      {
        "language": "Git",
        "icon": "fab fa-github",
        "percent": "80%"
      }
    ]
  },
  "projects": [
    {
      "title": "Scientific Research: Applying Computer Vision to Smart Camera",
      "description": [
        "Applying Computer Vision on Raspberry Pi for detecting and tracking people.",
        "Keeping specific person always in the middle of the frame by rotating camera with servos."
      ],
      "member": "5 people",
      "technology": [
        "Python",
        "OpenCV Library",
        "Deep Neural Networks (DNN) module",
        "Dlib's face detector",
        "GPIO.pi module for controlling and rotating servos",
        "ImageZMQ for live video streaming from Raspberry Pi to server"
      ],
      "responsibility": [
        "Setting up Raspberry Pi",
        "Design and assemble model for connecting Raspberry Pi, camera and servos",
        "Creating module for detecting and tracking",
        "Creating module for controlling and rotating servos"
      ],
      "startTime": "April 2019",
      "endTime": "December 2019"
    },
    {
      "title": "Image Captioning",
      "description": [
        "Building model for predict caption for image with Vietnamese caption.",
        "Setting up image captioning model on server to predict caption for image from Raspberry Pi Camera.",
        "Sending caption back from server to Raspberry Pi in order to speak out loud by speaker."
      ],
      "member": "4 people",
      "technology": [
        "Python",
        "Convolutional neural network (CNN)",
        "Recurrent neural network (RNN)",
        "Word Embedding",
        "ImageZMQ for sending image from Raspberry Pi Camera to server"
      ],
      "responsibility": [
        "Gathering and pre-processing dataset",
        "Training model for predict caption",
        "Setting up environment for connection between server and Raspberry Pi."
      ],
      "startTime": "September 2019",
      "endTime": "December 2019"
    },
    {
      "title": "Freelance: Sport Live Streaming Web Application",
      "description": [
        "Developing sport live streaming web application using HTTP Live Streaming FFMPEG"
      ],
      "member": "3 people",
      "technology": [
        "NGINX - RTMP module",
        "FFMPEG",
        "MVC Model",
        "HTML, CSS, SASS",
        "Bootstrap 4",
        "Javascript, AJAX",
        "NodeJS, ExpressJS",
        "MongoDB & Mongoose",
        "Pug View Engine"
      ],
      "responsibility": [
        "Database analysis",
        "Database design",
        "Backend Developer",
        "Rendering pages by using PUG View Engine"
      ],
      "startTime": "September 2019",
      "endTime": "November 2019"
    },
    {
      "title": "Agricutural Cooperatives 4.0",
      "description": [
        "Developing a system for agricutural production managing and diary logging.",
        "Web application for managing all facilies like plant production product, fertilizer, medical instrument,...",
        "Mobile application for logging all production diary of farmers."
      ],
      "member": "9 people",
      "technology": [
        "NodeJS",
        "ExpressJS",
        "ReactJS",
        "Bootstrap 4",
        "MongoDB"
      ],
      "responsibility": [
        "Database analysis",
        "Database design",
        "Backend develop"
      ],
      "startTime": "November 2019",
      "endTime": "Current"
    }
  ],
  "demo": [
    {
      "background": "",
      "time": "",
      "title": "",
      "description": "",
      "linkDemo": ""
    }
  ]
}
